[Killed] BlockStatement
app/pipes/is-old-enough-simple/is-old-enough-simple.pipe.ts:7:50
   name: 'isOldEnoughSimple',
 })
 export class IsOldEnoughSimplePipe {
-  transform(user: { name: string; age: number }) {
-    return user.age >= 18;
-    // return user.age > 18;
-  }
+  transform(user: { name: string; age: number }) {}
 }
 
killedBy: isOldEnoughSimplePipe should return when person is old enough
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
app/pipes/is-old-enough-simple/is-old-enough-simple.pipe.ts:8:12
 })
 export class IsOldEnoughSimplePipe {
   transform(user: { name: string; age: number }) {
-    return user.age >= 18;
+    return false;
     // return user.age > 18;
   }
killedBy: isOldEnoughSimplePipe should return when person is old enough
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] ConditionalExpression
app/pipes/is-old-enough-simple/is-old-enough-simple.pipe.ts:8:12
 })
 export class IsOldEnoughSimplePipe {
   transform(user: { name: string; age: number }) {
-    return user.age >= 18;
+    return true;
     // return user.age > 18;
   }
killedBy: isOldEnoughSimplePipe should return false when person is too young
statusReason: Error: expect(received).toBeFalsy()

Received: true
